test_app/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "string", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "first article"], ["string", ""], ["description", "describe first article"], ["created_at", "2021-10-31 10:44:32.690158"], ["updated_at", "2021-10-31 10:44:32.690158"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = ?, "string" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "edit first article"], ["string", "edit"], ["description", "edit describe first article"], ["updated_at", "2021-10-31 10:45:30.816520"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)